--------------------------------------------------------------------------------
      name:  <Chisheng Li>
       log:  \Desktop\solution3.log
  log type:  text
 opened on:  15 Jul 2014, 06:06:00

. * =================================================;
. * Chisheng Li Solution 3
> * =================================================;
. use "\Desktop\unions.dta", clear;

. regress hrwage union, robust;

Linear regression                                      Number of obs =    1000
                                                       F(  1,   998) =   53.65
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0545
                                                       Root MSE      =  8.4188

------------------------------------------------------------------------------
             |               Robust
      hrwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       union |   5.324295   .7268916     7.32   0.000     3.897883    6.750706
       _cons |    15.2858   .2901237    52.69   0.000     14.71648    15.85512
------------------------------------------------------------------------------

. outreg2 using "\Desktop\solution3.xls", addstat(Adjusted R-squa
> red, `e(r2_a)') replace;
\Desktop\solution3.xls
dir : seeout

. regress hrwage union age, robust;

Linear regression                                      Number of obs =    1000
                                                       F(  2,   997) =   48.95
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0930
                                                       Root MSE      =  8.2494

------------------------------------------------------------------------------
             |               Robust
      hrwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       union |   4.662216   .7270729     6.41   0.000     3.235447    6.088985
         age |   .1218292   .0183556     6.64   0.000      .085809    .1578493
       _cons |   10.43756   .7389661    14.12   0.000     8.987454    11.88767
------------------------------------------------------------------------------

. outreg2 using "\Desktop\solution3.xls", addstat(Adjusted R-squa
> red, `e(r2_a)') append;
\Desktop\solution3.xls
dir : seeout

. regress hrwage union age empsize, robust;

Linear regression                                      Number of obs =    1000
                                                       F(  3,   996) =   38.98
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1045
                                                       Root MSE      =  8.2015

------------------------------------------------------------------------------
             |               Robust
      hrwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       union |   4.140148    .758009     5.46   0.000      2.65267    5.627626
         age |   .1231519   .0182505     6.75   0.000     .0873381    .1589657
     empsize |   .0017124   .0004772     3.59   0.000      .000776    .0026488
       _cons |   9.229249   .7867947    11.73   0.000     7.685283    10.77321
------------------------------------------------------------------------------

. outreg2 using "\Desktop\solution3.xls", addstat(Adjusted R-squa
> red, `e(r2_a)') append;
\Desktop\solution3.xls
dir : seeout

. ttest hrwage, by(manager);

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     908    15.79662      .28316     8.53247     15.2409    16.35235
       1 |      92    20.31407    .9191141    8.815833    18.48836    22.13977
---------+--------------------------------------------------------------------
combined |    1000    16.21223    .2736502    8.653578    15.67523    16.74922
---------+--------------------------------------------------------------------
    diff |           -4.517444    .9364202               -6.355022   -2.679865
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -4.8242
Ho: diff = 0                                     degrees of freedom =      998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. ttest union, by(manager);

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     908    .1817181     .012804    .3858245    .1565891     .206847
       1 |      92    .0978261    .0311424    .2987072    .0359656    .1596866
---------+--------------------------------------------------------------------
combined |    1000        .174    .0119945    .3792992    .1504627    .1975373
---------+--------------------------------------------------------------------
    diff |             .083892    .0414355                .0025813    .1652026
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.0246
Ho: diff = 0                                     degrees of freedom =      998

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9784         Pr(|T| > |t|) = 0.0432          Pr(T > t) = 0.0216

. regress hrwage union age empsize manager, robust;

Linear regression                                      Number of obs =    1000
                                                       F(  4,   995) =   36.49
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1271
                                                       Root MSE      =  8.1014

------------------------------------------------------------------------------
             |               Robust
      hrwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       union |   4.429469   .7613091     5.82   0.000     2.935514    5.923425
         age |   .1182091   .0179572     6.58   0.000     .0829709    .1534474
     empsize |   .0015729    .000472     3.33   0.001     .0006467    .0024991
     manager |   4.522259   .9322119     4.85   0.000     2.692932    6.351586
       _cons |   9.065699    .778256    11.65   0.000     7.538488    10.59291
------------------------------------------------------------------------------

. outreg2 using "\Desktop\solution3.xls", addstat(Adjusted R-squa
> red, `e(r2_a)') append;
\Desktop\solution3.xls
dir : seeout

. log close;
      name:  <unnamed>
       log:  \Desktop\solution3.log
  log type:  text
 closed on:  15 Jul 2014, 06:06:01
--------------------------------------------------------------------------------
